{"events":[{"title":"UFC 291","image":"https://dmxg5wxfqgb4u.cloudfront.net/styles/background_image_xl/s3/2023-07/072923-ufc-291-poirier-vs-gaethje-2-EVENT-ART.jpg?h=d1cb525d&itok=BQrL7jZi","date":"2023-07-29","description":"Sat, Jul 29 / 9:00 PM CDT\n.\nDelta Center, Salt Lake City United States","id":"c842f220-b7f8-47c9-a5ea-f1d8f9fc7da6"},{"title":"Taste of Edmonton","image":"https://tasteofedm.ca/wp-content/uploads/2022/01/white-logo.png","date":"2023-07-22","description":"Welcome to the Taste of Edmonton, where the vibrant and lively Churchill Square serves as the backdrop to one of the country’s most talked about food festivals. The eleven day event boasts live performances of all genres, daily entertainment, and of course, features the best of Edmonton’s culinary scene. Taste of Edmonton is proud to be a non-profit organization that runs with the help of volunteerism and community involvement.","id":"b3339629-8785-4591-af86-00e8b08c9295"},{"title":"Bashaw Medieval Faire","image":"https://az837918.vo.msecnd.net/publishedimages/events/18392/en-CA/images/1/bashaw-medieval-faire-artisan-market-L-1.jpg","date":"2023-07-16","description":"Hear Ye, Hear Ye! Prepare thyself... Medieval Faires & Artisan Markets in Canada is journeying to Bashaw, Alberta! There was a time when Bashaw was without…but no more! The Bashaw Medieval Faires & Artisan Markets existeth to transport you to a time of majesty and magic. Don thy robes, gowns, armour, and burlap, and immerse yourself in Medieval Merriment. Walk with brave Knights, rub shoulders with Vikings, and wander the Medieval Market. Be amazed and entertained! Get ready for a weekend of epic excitement and treasures from throughout the realm... Ye Have Been Summoned!","id":"f5dfab36-fa1d-4dcb-a56a-a3dffbebdf53"},{"title":"MTG LOTR Jumpstart","image":"https://mktg-assets.tcgplayer.com/content/opengraph/mtg-sol-ring-lotr.png","date":"2023-07-09","description":"Jumpstart is a supplemental Magic booster set with mostly reprints and some new cards. The set is closely tied to Core Set 2021 but is a stand-alone product","id":"fc47155e-bd48-400f-a4a6-a467cbe0a049"},{"title":"AnimeThon","image":"https://animethon.org/images/logo_animethon_2023.png","date":"2023-07-14","description":"Animethon is a Japanese Animation (“anime”) themed festival held annually in the city of Edmonton, Alberta, Canada. We have expanded our focus beyond screening anime and now also include voice actor guests from North America, musical acts from North America and Japan, improvisation groups, as well as various related activities such as gaming, costume contests, and more. Animethon, as of 2004, is operated by the Alberta Society for Asian Popular Arts (ASAPA).","id":"ff736e8e-2db3-41da-bc6b-12e3ab2b4c32"},{"title":"RibFest","image":"https://assets.website-files.com/60f060b12df82baee89dcf86/60fa747c3748bba0dec6ecdf_ribfest_rgb_540w-p-500.png","date":"2023-07-15","description":"Bring the whole family to enjoy three days packed with good eats, local talents, contests and more!\nEnjoy world-class BBQ from the best in the business. #SGRIBFEST is hosting some of today's favourite local musical acts. Check out the entertainment schedule for times and details. Activities for young and the young at heart!","id":"0cd1dfaf-d1d3-48cf-a254-f00dc8c351e7"}]}